Public Member Functions | Friends | List of all members
ACAPI::MEP::TerminalUIManager Class Referencefinal
MEP Element Manager
The TerminalUIManager contains UI-related services for a Terminal. More...
#include <MEPTerminalUIManager.hpp>
 Inheritance diagram for ACAPI::MEP::TerminalUIManager:
 Public Member Functions
Result< TerminalDefault >  | CreateTerminalDefaultFromToolUIData (const TBUI::IAPIToolUIData &toolUIData)
Creates a TerminalDefault from a toolUIData.
Result< void >  | ApplyTerminalDefaultToToolUIData (TBUI::IAPIToolUIData &toolUIData, const TerminalDefault &terminalDefault)
Changes the default elem in the given toolUIData.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
Result< TerminalUIManager >  | CreateTerminalUIManager ()
Creates a TerminalUIManager.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The TerminalUIManager contains UI-related services for a Terminal.
Since
Archicad 28
Member Function Documentation
◆ ApplyTerminalDefaultToToolUIData()
 Result< void > ACAPI::MEP::TerminalUIManager::ApplyTerminalDefaultToToolUIData  |  ( |  TBUI::IAPIToolUIData & |  toolUIData,
|  const TerminalDefault & |  terminalDefault )
Changes the default elem in the given toolUIData.
Parameters
toolUIData | The data in which the default elem will be changed
terminalDefault | The default to be set
Returns
Returns error if the TerminalDefault is not the same type as the Default in IAPIToolUIData, or if they mismatch in their MEP Domain, otherwise nothing.
◆ CreateTerminalDefaultFromToolUIData()
 Result< TerminalDefault > ACAPI::MEP::TerminalUIManager::CreateTerminalDefaultFromToolUIData  |  ( |  const TBUI::IAPIToolUIData & |  toolUIData | )
Creates a TerminalDefault from a toolUIData.
Parameters
toolUIData | The data which contains the temporary state of the Terminal in the scope of a Settings Dialog.
Returns
Returns error if the given Default from the IAPIToolUIData is not an TerminalDefault, otherwise returns the TerminalDefault created from it.
Friends And Related Symbol Documentation
◆ CreateTerminalUIManager
 Result< TerminalUIManager > CreateTerminalUIManager  |  ( |   | )
friend
Creates a TerminalUIManager.
Returns
If able, creates a new manager for Terminal, otherwise Error.